t = 'وشنث فاث ّْ ساخص ذاشقفس شس فاثقث شقث زثهرل ذقثشفهي ، ساخص فاثو هر شرهوشفثي صشغذشري وشنث فاثو بثممس حشقف خب فاث ّْ رخف تعسف شححثشق'
map_pc = {'ض':'q', 'ص':'w', 'ث':'e', 'ق':'r', 'ف':'t', 'غ':'y', 'ع':'u', 'ه':'i', 'خ':'o', 'ح':'p', 'ج':'[', 'د':']', 'ش':'a', 'س':'s', 'ي':'d', 'ب':'f', 'ل':'g', 'ا':'h', 'ت':'j', 'ن':'k', 'م':'l', 'ك':';', 'ط':'\'', 'ز':'.', 'ظ':'/', 'و':',', 'ة':'m', 'ى':'n', 'لا':'b', 'ر':'v', 'ؤ':'c', 'ء':'x', 'ئ':'z', 'ذ':'`', 'ْ':'U', 'ّ':'I', '،':',', '؟':'?'}
print(''.join(map_pc.get(x,x) for x in t))
